1113870631/stm32c8_remoter/packages/nrf24l01-latest/src/nrf24l01.c
    struct {
        uint8_t p0          :1;
        uint8_t p1          :1;
        uint8_t p2          :1;
        uint8_t p3          :1;
        uint8_t p4          :1;
        uint8_t p5          :1;
    } dynpd;

    struct {
        uint8_t en_dyn_ack  :1;
        uint8_t en_ack_pay  :1;
        uint8_t en_dpl      :1;
    } feature;

    uint8_t rx_addr_p0[5];
    uint8_t rx_addr_p1[5];
    uint8_t rx_addr_p2;
    uint8_t rx_addr_p3;
    uint8_t rx_addr_p4;
    uint8_t rx_addr_p5;

    uint8_t tx_addr[5];

}ALIGN(1);

#ifdef NRF24_USING_SHELL_CMD
    nrf24_t g_debug_nrf24 = RT_NULL;
#endif

/** S PORT-ORIENTED */
/** |||||| **/

static uint8_t __read_reg(nrf24_t nrf24, uint8_t reg)
{
    uint8_t tmp, rtmp = 0;

    tmp = NRF24CMD_R_REG | reg;
    NRF24_HALPORT_SEND_THEN_RECV(&tmp, 1, &rtmp, 1);
    return rtmp;
}

static void __write_reg(nrf24_t nrf24, uint8_t reg, uint8_t data)
{
    uint8_t tmp[2];

    tmp[0] = NRF24CMD_W_REG | reg;
    tmp[1] = data;
    NRF24_HALPORT_WRITE(&tmp[0], 2);
}

// /**
//  * @brief Set bit(s) to 1 based on bit-mask
//  * @param[in] mask: bit mask.   e.g 0x81 stands for bit7 and bit0
//  */
// static void __set_reg_bits(nrf24_t nrf24, uint8_t reg, uint8_t mask)
// {
//     uint8_t tmp;

//     tmp = __read_reg(nrf24, reg);
//     tmp |= mask;
//     __write_reg(nrf24, reg, tmp);
// }

// static void __reset_reg_bits(nrf24_t nrf24, uint8_t reg, uint8_t mask)
// {
//     uint8_t tmp;

//     tmp = __read_reg(nrf24, reg);
//     tmp &= ~mask;
//     __write_reg(nrf24, reg, tmp);
// }

/**
 * @brief Treat the specified continuous bit as a whole and then set its value
 */
static void __write_reg_bits(nrf24_t nrf24, uint8_t reg, uint8_t mask, uint8_t value)
{
    uint8_t tmp, tidx;

    for (tidx = 0; tidx < 8; tidx++)
    {
        if (mask & (1 << tidx))
            break;
    }
    tmp = ~mask & __read_reg(nrf24, reg);
    tmp |= mask & (value << tidx);
    __write_reg(nrf24, reg, tmp);
}

/** E PORT-ORIENTED*/

/** S SCALPEL */
/** |||||| **/

static uint8_t read_status(nrf24_t nrf24)
{
    return __read_reg(nrf24, NRF24REG_STATUS);
}

// bit: RX_DR, TX_DS, MAX_RT
static void clear_status(nrf24_t nrf24, uint8_t bitmask)
{
    __write_reg(nrf24, NRF24REG_STATUS, bitmask);
}

static void clear_observe_tx(nrf24_t nrf24)
{
    __write_reg(nrf24, NRF24REG_OBSERVE_TX, 0);
}

static uint8_t read_top_rxfifo_width(nrf24_t nrf24)
{
    uint8_t tmp = NRF24CMD_R_RX_PL_WID;

    NRF24_HALPORT_SEND_THEN_RECV(&tmp, 1, &tmp, 1);
    return tmp;
}

void nrf24_enter_power_down_mode(nrf24_t nrf24)
{
    __write_reg_bits(nrf24, NRF24REG_CONFIG, NRF24BITMASK_PWR_UP, 0);
}

void nrf24_enter_power_up_mode(nrf24_t nrf24)
{
    __write_reg_bits(nrf24, NRF24REG_CONFIG, NRF24BITMASK_PWR_UP, 1);
}

// static void enabled_irq(nrf24_t nrf24, uint8_t bitmask)
// {
//     if (!((bitmask == NRF24BITMASK_RX_DR) || (bitmask == NRF24BITMASK_TX_DS) || (bitmask == NRF24BITMASK_MAX_RT)))
//         return;

//     __reset_reg_bits(nrf24, NRF24REG_CONFIG, bitmask);
// }

// static void disable_irq(nrf24_t nrf24, uint8_t bitmask)
// {
//     if (!((bitmask == NRF24BITMASK_RX_DR) || (bitmask == NRF24BITMASK_TX_DS) || (bitmask == NRF24BITMASK_MAX_RT)))
//         return;

//     __set_reg_bits(nrf24, NRF24REG_CONFIG, bitmask);
// }


static void write_tx_payload(nrf24_t nrf24, const uint8_t *buf, uint8_t len)
{
    uint8_t tmp = NRF24CMD_W_TX_PAYLOAD;

    NRF24_HALPORT_SEND_THEN_SEND(&tmp, 1, buf, len);
}

static void write_ack_payload(nrf24_t nrf24, uint8_t pipe, const uint8_t *buf, uint8_t len)
{
    uint8_t tmp;

    if (pipe > 5)
        return;

    tmp = NRF24CMD_W_ACK_PAYLOAD | pipe;
    NRF24_HALPORT_SEND_THEN_SEND(&tmp, 1, buf, len);
}

// static int read_rx_payload_width(nrf24_t nrf24, uint8_t pipe)
// {
//     if (pipe > 5)
//         return 0;

//     uint8_t len = __read_reg(nrf24, NRF24REG_RX_PW_P0+pipe);

//     return len;
// }

static void read_rx_payload(nrf24_t nrf24, uint8_t *buf, uint8_t len)
{
    uint8_t tcmd;

    if ((len > 32) || (len == 0))
        return;

    tcmd = NRF24CMD_R_RX_PAYLOAD;
    NRF24_HALPORT_SEND_THEN_RECV(&tcmd, 1, buf, len);
}

static void flush_tx_fifo(nrf24_t nrf24)
{
    uint8_t tmp = NRF24CMD_FLUSH_TX;

    NRF24_HALPORT_WRITE(&tmp, 1);
}

static void flush_rx_fifo(nrf24_t nrf24)
{
    uint8_t tmp = NRF24CMD_FLUSH_RX;

    NRF24_HALPORT_WRITE(&tmp, 1);
}

/** E SCALPEL */

static void ensure_rww_features_activated(nrf24_t nrf24)
{
    if (!nrf24->flags.activated_features)
    {
        uint8_t tmp[2] = {NRF24CMD_ACTIVATE, 0x73};
        NRF24_HALPORT_WRITE(tmp, 2);
        nrf24->flags.activated_features = RT_TRUE;
    }
}

static int update_onchip_config(nrf24_t nrf24, const struct nrf24_onchip_cfg *ccfg)
{
    uint8_t tmp;

    nrf24_enter_power_down_mode(nrf24);
    ensure_rww_features_activated(nrf24);

    __write_reg(nrf24, NRF24REG_EN_AA,      *((uint8_t *)&ccfg->en_aa));
    __write_reg(nrf24, NRF24REG_EN_RXADDR,  *((uint8_t *)&ccfg->en_rxaddr));
    __write_reg(nrf24, NRF24REG_SETUP_AW,   *((uint8_t *)&ccfg->setup_aw));
    __write_reg(nrf24, NRF24REG_SETUP_RETR, *((uint8_t *)&ccfg->setup_retr));
    __write_reg(nrf24, NRF24REG_RF_CH,      *((uint8_t *)&ccfg->rf_ch));
    __write_reg(nrf24, NRF24REG_RF_SETUP,   *((uint8_t *)&ccfg->rf_setup));
    __write_reg(nrf24, NRF24REG_DYNPD,      *((uint8_t *)&ccfg->dynpd));
    __write_reg(nrf24, NRF24REG_FEATURE,    *((uint8_t *)&ccfg->feature));

    tmp = NRF24CMD_W_REG | NRF24REG_TX_ADDR;
    NRF24_HALPORT_SEND_THEN_SEND(&tmp, 1, ccfg->tx_addr, 5);
    tmp = NRF24CMD_W_REG | NRF24REG_RX_ADDR_P0;
    NRF24_HALPORT_SEND_THEN_SEND(&tmp, 1, ccfg->rx_addr_p0, 5);
    tmp = NRF24CMD_W_REG | NRF24REG_RX_ADDR_P1;
    NRF24_HALPORT_SEND_THEN_SEND(&tmp, 1, ccfg->rx_addr_p1, 5);
    tmp = NRF24CMD_W_REG | NRF24REG_RX_ADDR_P2;
    NRF24_HALPORT_SEND_THEN_SEND(&tmp, 1, &ccfg->rx_addr_p2, 1);
    tmp = NRF24CMD_W_REG | NRF24REG_RX_ADDR_P3;
    NRF24_HALPORT_SEND_THEN_SEND(&tmp, 1, &ccfg->rx_addr_p3, 1);
    tmp = NRF24CMD_W_REG | NRF24REG_RX_ADDR_P4;
    NRF24_HALPORT_SEND_THEN_SEND(&tmp, 1, &ccfg->rx_addr_p4, 1);
    tmp = NRF24CMD_W_REG | NRF24REG_RX_ADDR_P5;
    NRF24_HALPORT_SEND_THEN_SEND(&tmp, 1, &ccfg->rx_addr_p5, 1);

    __write_reg(nrf24, NRF24REG_CONFIG,     *((uint8_t *)&ccfg->config));

