1113870631/stm32c8_remoter/packages/nrf24l01-latest/src/nrf24l01.c
    return RT_EOK;
}

static int read_onchip_config(nrf24_t nrf24, struct nrf24_onchip_cfg *ccfg)
{
    struct nrf24_onchip_cfg real_cfg;
    uint8_t tmp;

    *((uint8_t *)&real_cfg.en_aa)      =  __read_reg(nrf24, NRF24REG_EN_AA);
    *((uint8_t *)&real_cfg.en_rxaddr)  =  __read_reg(nrf24, NRF24REG_EN_RXADDR);
    *((uint8_t *)&real_cfg.setup_aw)   =  __read_reg(nrf24, NRF24REG_SETUP_AW);
    *((uint8_t *)&real_cfg.setup_retr) =  __read_reg(nrf24, NRF24REG_SETUP_RETR);
    *((uint8_t *)&real_cfg.rf_ch)      =  __read_reg(nrf24, NRF24REG_RF_CH);
    *((uint8_t *)&real_cfg.rf_setup)   =  __read_reg(nrf24, NRF24REG_RF_SETUP);
    *((uint8_t *)&real_cfg.dynpd)      =  __read_reg(nrf24, NRF24REG_DYNPD);
    *((uint8_t *)&real_cfg.feature)    =  __read_reg(nrf24, NRF24REG_FEATURE);
    *((uint8_t *)&real_cfg.config)     =  __read_reg(nrf24, NRF24REG_CONFIG);

    tmp = NRF24CMD_R_REG | NRF24REG_TX_ADDR;
    NRF24_HALPORT_SEND_THEN_RECV(&tmp, 1, (uint8_t *)&real_cfg.tx_addr, 5);
    tmp = NRF24CMD_R_REG | NRF24REG_RX_ADDR_P0;
    NRF24_HALPORT_SEND_THEN_RECV(&tmp, 1, (uint8_t *)&real_cfg.rx_addr_p0, 5);
    tmp = NRF24CMD_R_REG | NRF24REG_RX_ADDR_P1;
    NRF24_HALPORT_SEND_THEN_RECV(&tmp, 1, (uint8_t *)&real_cfg.rx_addr_p1, 5);
    tmp = NRF24CMD_R_REG | NRF24REG_RX_ADDR_P2;
    NRF24_HALPORT_SEND_THEN_RECV(&tmp, 1, (uint8_t *)&real_cfg.rx_addr_p2, 1);
    tmp = NRF24CMD_R_REG | NRF24REG_RX_ADDR_P3;
    NRF24_HALPORT_SEND_THEN_RECV(&tmp, 1, (uint8_t *)&real_cfg.rx_addr_p3, 1);
    tmp = NRF24CMD_R_REG | NRF24REG_RX_ADDR_P4;
    NRF24_HALPORT_SEND_THEN_RECV(&tmp, 1, (uint8_t *)&real_cfg.rx_addr_p4, 1);
    tmp = NRF24CMD_R_REG | NRF24REG_RX_ADDR_P5;
    NRF24_HALPORT_SEND_THEN_RECV(&tmp, 1, (uint8_t *)&real_cfg.rx_addr_p5, 1);

    rt_memcpy(ccfg, &real_cfg, sizeof(struct nrf24_onchip_cfg));

    return RT_EOK;
}

static int check_onchip_config(nrf24_t nrf24, const struct nrf24_onchip_cfg *ccfg)
{
    struct nrf24_onchip_cfg real_cfg;

    read_onchip_config(nrf24, &real_cfg);

    if (rt_memcmp(&real_cfg, ccfg, sizeof(struct nrf24_onchip_cfg)) == 0)
        return RT_EOK;
    else
        return RT_ERROR;
}

static int build_onchip_config(struct nrf24_onchip_cfg *ccfg, const struct nrf24_cfg *ucfg)
{
    rt_memset(ccfg, 0, sizeof(struct nrf24_onchip_cfg));

    /* Default config */
    ccfg->setup_retr.ard = 1;   // 500us
    ccfg->setup_retr.arc = 11;  // 11 times
    ccfg->setup_aw.aw = 3;      // 5-byte address width

    ccfg->rf_setup.pll_lock = 0;
    ccfg->rf_setup.lna_hcurr = 1;

    ccfg->en_aa.p0 = 1;
    ccfg->en_aa.p1 = 1;
    ccfg->en_aa.p2 = 1;
    ccfg->en_aa.p3 = 1;
    ccfg->en_aa.p4 = 1;
    ccfg->en_aa.p5 = 1;

    ccfg->dynpd.p0 = 1;
    ccfg->dynpd.p1 = 1;
    ccfg->dynpd.p2 = 1;
    ccfg->dynpd.p3 = 1;
    ccfg->dynpd.p4 = 1;
    ccfg->dynpd.p5 = 1;

    ccfg->feature.en_dyn_ack = 1;
    ccfg->feature.en_ack_pay = 1;
    ccfg->feature.en_dpl = 1;
    /* END Default config*/

    /**/
    if (ucfg->_irq_pin == NRF24_PIN_NONE)
    {
        ccfg->config.mask_rx_dr = 1;
        ccfg->config.mask_tx_ds = 1;
        ccfg->config.mask_max_rt = 1;
    }
    
    ccfg->config.pwr_up = 1;
    ccfg->config.prim_rx = ucfg->role;
    ccfg->config.en_crc = 1;
    ccfg->config.crco = ucfg->crc;

    ccfg->rf_setup.rf_pwr = ucfg->power;
    ccfg->rf_setup.rf_dr = ucfg->adr;
    ccfg->rf_ch.rf_ch = ucfg->channel;

    rt_memcpy(ccfg->tx_addr, ucfg->txaddr, sizeof(ucfg->txaddr));

    ccfg->en_rxaddr.p0 = ucfg->rxpipe0.bl_enabled;
    ccfg->en_rxaddr.p1 = ucfg->rxpipe1.bl_enabled;
    ccfg->en_rxaddr.p2 = ucfg->rxpipe2.bl_enabled;
    ccfg->en_rxaddr.p3 = ucfg->rxpipe3.bl_enabled;
    ccfg->en_rxaddr.p4 = ucfg->rxpipe4.bl_enabled;
    ccfg->en_rxaddr.p5 = ucfg->rxpipe5.bl_enabled;

    rt_memcpy(ccfg->rx_addr_p0, ucfg->rxpipe0.addr, sizeof(ucfg->rxpipe0.addr));
    rt_memcpy(ccfg->rx_addr_p1, ucfg->rxpipe1.addr, sizeof(ucfg->rxpipe1.addr));
    ccfg->rx_addr_p2 = ucfg->rxpipe2.addr;
    ccfg->rx_addr_p3 = ucfg->rxpipe3.addr;
    ccfg->rx_addr_p4 = ucfg->rxpipe4.addr;
    ccfg->rx_addr_p5 = ucfg->rxpipe5.addr;

    return RT_EOK;
}

/**
 * Test the connection with NRF24
 */
static int check_halport(hal_nrf24_port_t halport)
{
    uint8_t addr[5] = {1,2,3,4,5}, backup_addr[5];
    uint8_t tmp;

    RT_ASSERT(halport != RT_NULL);
    RT_ASSERT(halport->ops != RT_NULL);

    tmp = NRF24CMD_R_REG | NRF24REG_RX_ADDR_P1;
    halport->ops->send_then_recv(halport, &tmp, 1, backup_addr, 5);
    for(int i=0;i<5;i++)
    {
       //LOG_I("%d\n",backup_addr[i]);
    };




    tmp = NRF24CMD_W_REG | NRF24REG_RX_ADDR_P1;
    halport->ops->send_then_send(halport, &tmp, 1, addr, 5);

    rt_memset(addr, 0, 5);

    tmp = NRF24CMD_R_REG | NRF24REG_RX_ADDR_P1;
    halport->ops->send_then_recv(halport, &tmp, 1, addr, 5);
    for(int i=0;i<5;i++)
    {
       LOG_I("%d\n",addr[i]);
    };

    for (int i = 0; i < 5; i++)
    {
        if (addr[i] != i+1)
            return RT_ERROR;
    }

    tmp = NRF24CMD_W_REG | NRF24REG_RX_ADDR_P1;
    halport->ops->send_then_send(halport, &tmp, 1, backup_addr, 5);

    return RT_EOK;
}

/**
 * Set the user-oriented configuration as the default
 */
int nrf24_fill_default_config_on(nrf24_cfg_t cfg)
{
    RT_ASSERT(cfg != RT_NULL);

    rt_memset(cfg, 0, sizeof(struct nrf24_cfg));

    cfg->power = RF_POWER_0dBm;
    cfg->crc = CRC_2_BYTE;
    cfg->adr = ADR_2Mbps;
    cfg->channel = 100;
    cfg->role = ROLE_NONE;

    for (int i = 0; i < 5; i++)
    {
        cfg->txaddr[i] = i;
        cfg->rxpipe0.addr[i] = i;
        cfg->rxpipe1.addr[i] = i+1;
    }
    cfg->rxpipe2.addr = 2;
    cfg->rxpipe3.addr = 3;
    cfg->rxpipe4.addr = 4;
    cfg->rxpipe5.addr = 5;

    cfg->rxpipe0.bl_enabled = RT_TRUE;
    cfg->rxpipe1.bl_enabled = RT_TRUE;

    cfg->rxpipe2.bl_enabled = RT_FALSE;
    cfg->rxpipe3.bl_enabled = RT_FALSE;
    cfg->rxpipe4.bl_enabled = RT_FALSE;
    cfg->rxpipe5.bl_enabled = RT_FALSE;

    return RT_EOK;
}

int nrf24_send_data(nrf24_t nrf24, uint8_t *data, uint8_t len, uint8_t pipe)
{
    if (len > 32)
        return RT_ERROR;

    if (nrf24->cfg.role == ROLE_PTX)
    {
        write_tx_payload(nrf24, data, len);
    }
    else
    {
        write_ack_payload(nrf24, pipe, data, len);
        rt_sem_release(nrf24->send_sem);
    }
    
