1113870631/stm32c8_remoter/packages/nrf24l01-latest/src/nrf24l01.c
    return RT_EOK;
}

void __irq_handler(hal_nrf24_port_t halport)
{
    nrf24_t nrf24 = (nrf24_t)halport;

    rt_sem_release(nrf24->sem);
}

/**
 * ? if try to create sem with the existing name, what will happen
 */
int nrf24_init(nrf24_t nrf24, char *spi_dev_name, int ce_pin, int irq_pin, const struct nrf24_callback *cb, const nrf24_cfg_t cfg)
{
    struct nrf24_onchip_cfg onchip_cfg;

    RT_ASSERT(nrf24 != RT_NULL);
    RT_ASSERT(cfg != RT_NULL);

    RT_ASSERT(cb != RT_NULL);

    rt_memset(nrf24, 0, sizeof(struct nrf24));

    nrf24->send_sem = rt_sem_create("nrfsend", 0, RT_IPC_FLAG_FIFO);
    if (nrf24->send_sem == RT_NULL)
    {
        LOG_E("Failed to create sem");
        return RT_ERROR;
    }

    if (irq_pin != NRF24_PIN_NONE)
    {
        nrf24->sem = rt_sem_create("nrfirq", 0, RT_IPC_FLAG_FIFO);
        if (nrf24->sem == RT_NULL)
        {
            LOG_E("Failed to create sem");
            return RT_ERROR;
        }

        nrf24->flags.using_irq = RT_TRUE;
    }
    else
    {
        nrf24->flags.using_irq = RT_FALSE;
    }

    rt_memcpy(&nrf24->cb, cb, sizeof(struct nrf24_callback));
    rt_memcpy(&nrf24->cfg, cfg, sizeof(struct nrf24_cfg));
    nrf24->cfg._irq_pin = irq_pin;

    if (hal_nrf24_port_init(&nrf24->halport, spi_dev_name, ce_pin, irq_pin, __irq_handler) != RT_EOK)
        return RT_ERROR;

    if (check_halport(&nrf24->halport) != RT_EOK)
        return RT_ERROR;

    if (build_onchip_config(&onchip_cfg, &nrf24->cfg) != RT_EOK)
        return RT_ERROR;

    if (update_onchip_config(nrf24, &onchip_cfg) != RT_EOK)
        return RT_ERROR;

    if (check_onchip_config(nrf24, &onchip_cfg) != RT_EOK)
        return RT_ERROR;

    flush_tx_fifo(nrf24);
    flush_rx_fifo(nrf24);
    clear_status(nrf24, NRF24BITMASK_RX_DR | NRF24BITMASK_TX_DS | NRF24BITMASK_MAX_RT);
    clear_observe_tx(nrf24);

    nrf24_enter_power_up_mode(nrf24);
    nrf24->halport.ops->set_ce(&nrf24->halport);

    LOG_I("Successfully initialized");

#ifdef NRF24_USING_SHELL_CMD
    g_debug_nrf24 = nrf24;
#endif

    return RT_EOK;
}

nrf24_t nrf24_create(char *spi_dev_name, int ce_pin, int irq_pin, const struct nrf24_callback *cb, const nrf24_cfg_t cfg)
{
    RT_ASSERT(cfg != RT_NULL);

    nrf24_t new_nrf24 = (nrf24_t)rt_malloc(sizeof(struct nrf24));
    if (new_nrf24 == RT_NULL)
    {
        rt_free(new_nrf24);
        LOG_E("Failed to allocate memory!");
    }
    else
    {
        if (nrf24_init(new_nrf24, spi_dev_name, ce_pin, irq_pin, cb, cfg) != RT_EOK)
        {
            rt_free(new_nrf24);
            new_nrf24 = RT_NULL;
        }
    }

    if (new_nrf24 == RT_NULL)
        LOG_E("Failed to create nrf24 instance");

    return new_nrf24;
}

int nrf24_default_init(nrf24_t nrf24, char *spi_dev_name, int ce_pin, int irq_pin, const struct nrf24_callback *cb, nrf24_role_et role)
{
    struct nrf24_cfg cfg;

    nrf24_fill_default_config_on(&cfg);
    cfg.role = role;
    return nrf24_init(nrf24, spi_dev_name, ce_pin, irq_pin, cb, &cfg);
}

nrf24_t nrf24_default_create(char *spi_dev_name, int ce_pin, int irq_pin, const struct nrf24_callback *cb, nrf24_role_et role)
{
    nrf24_t new_nrf24 = (nrf24_t)rt_malloc(sizeof(struct nrf24));
    if (new_nrf24 == RT_NULL)
    {
        rt_free(new_nrf24);
        LOG_E("Failed to allocate memory!");
    }
    else
    {
        if (nrf24_default_init(new_nrf24, spi_dev_name, ce_pin, irq_pin, cb, role) != RT_EOK)
        {
            rt_free(new_nrf24);
            new_nrf24 = RT_NULL;
        }
    }

    if (new_nrf24 == RT_NULL)
        LOG_E("Failed to create nrf24 instance");

    return new_nrf24;
}

/**
 * check status and inform
 * @param nrf24 pointer of nrf24 instance
 * @return -x:error   0:nothing   1:tx_done   2:rx_done   3:tx_rx_done
 */
int nrf24_run(nrf24_t nrf24)
{
    int rvl = 0;

    if (nrf24->flags.using_irq)
    {
        rt_sem_take(nrf24->sem, RT_WAITING_FOREVER);
    }

    nrf24->status = read_status(nrf24);
    clear_status(nrf24, NRF24BITMASK_RX_DR | NRF24BITMASK_TX_DS);

    uint8_t pipe = (nrf24->status & NRF24BITMASK_RX_P_NO) >> 1;

    if (nrf24->cfg.role == ROLE_PTX)
    {
        if (nrf24->status & NRF24BITMASK_MAX_RT)
        {
            flush_tx_fifo(nrf24);
            clear_status(nrf24, NRF24BITMASK_MAX_RT);
            if(nrf24->cb.tx_done) nrf24->cb.tx_done(nrf24, NRF24_PIPE_NONE);
            return -1;
        }

        if (nrf24->status & NRF24BITMASK_RX_DR)
        {
            uint8_t data[32];
            uint8_t len = read_top_rxfifo_width(nrf24);

            read_rx_payload(nrf24, data, len);
            if (nrf24->cb.rx_ind) nrf24->cb.rx_ind(nrf24, data, len, pipe);

            rvl |= 2;
        }

        if (nrf24->status & NRF24BITMASK_TX_DS)
        {
            if (nrf24->cb.tx_done) nrf24->cb.tx_done(nrf24, pipe);

            rvl |= 1;
        }
    }
    else
    {
        if (pipe <= 5)
        {
            uint8_t data[32];
            uint8_t len = read_top_rxfifo_width(nrf24);

            read_rx_payload(nrf24, data, len);
            if (nrf24->cb.rx_ind) nrf24->cb.rx_ind(nrf24, data, len, pipe);

            rvl |= 2;

            if (rt_sem_trytake(nrf24->send_sem) == RT_EOK)
            {
                if (nrf24->cb.tx_done) nrf24->cb.tx_done(nrf24, pipe);
                rvl |= 1;
            }
        }
    }

    return rvl;
}

/** S DEBUG */
/** |||||| **/

#if defined(NRF24_USING_INFO_REPORT)

void __nrf24_report_config_reg(uint8_t data)
{
    if (data & NRF24BITMASK_PRIM_RX)
        rt_kprintf("PRX mode\r\n");
    else
        rt_kprintf("PTX mode\r\n");
    if (data & NRF24BITMASK_EN_CRC)
    {
        rt_kprintf("crc opened. FCS: ");
        if (data & NRF24BITMASK_CRCO)
            rt_kprintf("2bytes\r\n");
        else
            rt_kprintf("1byte\r\n");
    }
    else
        rt_kprintf("crc closed\r\n");
    if (!(data & (NRF24BITMASK_RX_DR | NRF24BITMASK_TX_DS | NRF24BITMASK_MAX_RT)))
    {
        if (!(data & NRF24BITMASK_RX_DR))
            rt_kprintf("RX irq; ");
        if (!(data & NRF24BITMASK_TX_DS))
            rt_kprintf("TX irq; ");
        if (!(data & NRF24BITMASK_MAX_RT))
            rt_kprintf("MAX_RT irq; ");
        rt_kprintf("opened\r\n");
    }
    else
    {
        rt_kprintf("all irq closed\r\n");
    }
    if (data & NRF24BITMASK_PWR_UP)
        rt_kprintf("power up now\r\n");
    else
        rt_kprintf("power down now\r\n");
}

void __nrf24_report_enaa_reg(uint8_t data)
{
    if (!(data & 0x3F))
    {
        rt_kprintf("all pipe AA closed");
        return;
    }

    if (data & NRF24BITMASK_PIPE_0)
        rt_kprintf("pipe0 ");
    if (data & NRF24BITMASK_PIPE_1)
        rt_kprintf("pipe1 ");
    if (data & NRF24BITMASK_PIPE_2)
        rt_kprintf("pipe2 ");
    if (data & NRF24BITMASK_PIPE_3)
        rt_kprintf("pipe3 ");
    if (data & NRF24BITMASK_PIPE_4)
        rt_kprintf("pipe4 ");
    if (data & NRF24BITMASK_PIPE_5)
        rt_kprintf("pipe5 ");
    rt_kprintf("AA opened\r\n");
}
void __nrf24_report_enrxaddr_reg(uint8_t data)
{
    if (!(data & 0x3F))
    {
        rt_kprintf("all rx-pipe closed");
        return;
    }

    if (data & NRF24BITMASK_PIPE_0)
        rt_kprintf("rx-pipe0 ");
    if (data & NRF24BITMASK_PIPE_1)
        rt_kprintf("rx-pipe1 ");
    if (data & NRF24BITMASK_PIPE_2)
        rt_kprintf("rx-pipe2 ");
    if (data & NRF24BITMASK_PIPE_3)
        rt_kprintf("rx-pipe3 ");
    if (data & NRF24BITMASK_PIPE_4)
        rt_kprintf("rx-pipe4 ");
    if (data & NRF24BITMASK_PIPE_5)
        rt_kprintf("rx-pipe5 ");
    rt_kprintf(" opened\r\n");
}
void __nrf24_report_setupaw_reg(uint8_t data)
{
    rt_kprintf("rx/tx address field width: ");
    switch (data & 0x3)
    {
    case 0:
        rt_kprintf("illegal\r\n");
        break;
    case 1:
        rt_kprintf("3bytes\r\n");
        break;
    case 2:
        rt_kprintf("4bytes\r\n");
        break;
    case 3:
        rt_kprintf("5bytes\r\n");
        break;
    }
}
void __nrf24_report_setupretr_reg(uint8_t data)
{
    rt_kprintf("auto retransmit delay: %dus\r\n", (((data & 0xF0) >> 4) + 1) * 250);
    rt_kprintf("auto retransmit count: up to %d\r\n", (data & 0x0F));
}
void __nrf24_report_rfch_reg(uint8_t data)
{
    rt_kprintf("rf channel: %d\r\n", data & 0x7F);
}
void __nrf24_report_rfsetup_reg(uint8_t data)
{
    rt_kprintf("air data rate: ");
    if (data & NRF24BITMASK_RF_DR)
        rt_kprintf("2Mbps\r\n");
    else
        rt_kprintf("1Mbsp\r\n");

    rt_kprintf("rf power: ");
    switch ((data & NRF24BITMASK_RF_PWR) >> 1)
    {
    case 0:
        rt_kprintf("-18dBm\r\n");
        break;
    case 1:
        rt_kprintf("-12dBm\r\n");
        break;
    case 2:
        rt_kprintf("-6dBm\r\n");
        break;
    case 3:
        rt_kprintf("0dBm\r\n");
        break;
    }
}
void __nrf24_report_status_reg(uint8_t data)
{
    rt_kprintf("status: ");
    if (data & NRF24BITMASK_RX_DR)
        rt_kprintf("new rx data; ");
    if (data & NRF24BITMASK_TX_DS)
        rt_kprintf("last tx ok; ");
    if (data & NRF24BITMASK_MAX_RT)
        rt_kprintf("max-rt error exist; ");

    if (data & NRF24BITMASK_TX_FULL)
        rt_kprintf("tx-fifo is full; ");
    else
        rt_kprintf("tx-fifo is not full; ");

    data = (data & NRF24BITMASK_RX_P_NO) >> 1;
    if (data > 5)
    {
        if (data == 7)
            rt_kprintf("rx-fifo empty; ");
        else
            rt_kprintf("rx-fifo not used?; ");
    }
    else
    {
        rt_kprintf("rx-fifo pipe: %d; ", data);
    }

