1113870631/stm32c8_remoter/packages/nrf24l01-latest/src/nrf24l01.c
    rt_kprintf("\r\n");
}
void __nrf24_report_observetx_reg(uint8_t data)
{
    rt_kprintf("lost packets count: %d\r\n", (data & NRF24BITMASK_PLOS_CNT) >> 4);
    rt_kprintf("retransmitted packets count: %d\r\n", data & NRF24BITMASK_ARC_CNT);
}

void __nrf24_report_fifostatus_reg(uint8_t data)
{
    if (data & NRF24BITMASK_TX_REUSE)
        rt_kprintf("tx-reuse opened\r\n");

    if (data & NRF24BITMASK_TX_FULL2)
        rt_kprintf("tx-fifo full\r\n");
    else if (data & NRF24BITMASK_TX_EMPTY)
        rt_kprintf("tx-fifo empty\r\n");
    else
        rt_kprintf("tx-fifo has some data\r\n");

    if (data & NRF24BITMASK_RX_RXFULL)
        rt_kprintf("rx-fifo full\r\n");
    else if (data & NRF24BITMASK_RX_EMPTY)
        rt_kprintf("rx-fifo empty\r\n");
    else
        rt_kprintf("rx-fifo has some data\r\n");
}
void __nrf24_report_dynpd_reg(uint8_t data)
{
    rt_kprintf("dynamic payload length enabled (pipe): ");
    if (!(data & 0x3F))
    {
        rt_kprintf("none\r\n");
        return;
    }

    if (data & NRF24BITMASK_PIPE_0)
        rt_kprintf("pipe0; ");
    if (data & NRF24BITMASK_PIPE_1)
        rt_kprintf("pipe1; ");
    if (data & NRF24BITMASK_PIPE_2)
        rt_kprintf("pipe2; ");
    if (data & NRF24BITMASK_PIPE_3)
        rt_kprintf("pipe3; ");
    if (data & NRF24BITMASK_PIPE_4)
        rt_kprintf("pipe4; ");
    if (data & NRF24BITMASK_PIPE_5)
        rt_kprintf("pipe5; ");
    rt_kprintf("\r\n");
}
void __nrf24_report_feature_reg(uint8_t data)
{
    rt_kprintf("feature enabled conditions: ");
    if (data & NRF24BITMASK_EN_DPL)
        rt_kprintf("dynamic payload length; ");
    if (data & NRF24BITMASK_EN_ACK_PAY)
        rt_kprintf("payload with ack; ");
    if (data & NRF24BITMASK_EN_DYN_ACK)
        rt_kprintf("W_TX_PAYLOAD_NOACK command; ");

    rt_kprintf("\r\n");
}

void __nrf24_report_addr(nrf24_t nrf24)
{
    struct nrf24_onchip_cfg ccfg;
    read_onchip_config(nrf24, &ccfg);
    rt_kprintf("tx-addr:0x%02x%02x%02x%02x%02x\n", 
        ccfg.tx_addr[4],
        ccfg.tx_addr[3],
        ccfg.tx_addr[2],
        ccfg.tx_addr[1],
        ccfg.tx_addr[0]);

    rt_kprintf("rx-addr-p0:0x%02x%02x%02x%02x%02x\n", 
        ccfg.rx_addr_p0[4],
        ccfg.rx_addr_p0[3],
        ccfg.rx_addr_p0[2],
        ccfg.rx_addr_p0[1],
        ccfg.rx_addr_p0[0]);

    rt_kprintf("rx-addr-p1:0x%02x%02x%02x%02x%02x\n", 
        ccfg.rx_addr_p1[4],
        ccfg.rx_addr_p1[3],
        ccfg.rx_addr_p1[2],
        ccfg.rx_addr_p1[1],
        ccfg.rx_addr_p1[0]);

    rt_kprintf("rx-addr-p2:0x%02x\n", ccfg.rx_addr_p2);
    rt_kprintf("rx-addr-p3:0x%02x\n", ccfg.rx_addr_p3);
    rt_kprintf("rx-addr-p4:0x%02x\n", ccfg.rx_addr_p4);
    rt_kprintf("rx-addr-p5:0x%02x\n", ccfg.rx_addr_p5);
}

void nrf24_report(nrf24_t nrf24)
{
    __nrf24_report_config_reg(__read_reg(nrf24, NRF24REG_CONFIG));
    __nrf24_report_enaa_reg(__read_reg(nrf24, NRF24REG_EN_AA));
    __nrf24_report_enrxaddr_reg(__read_reg(nrf24, NRF24REG_EN_RXADDR));
    __nrf24_report_setupaw_reg(__read_reg(nrf24, NRF24REG_SETUP_AW));
    __nrf24_report_setupretr_reg(__read_reg(nrf24, NRF24REG_SETUP_RETR));
    __nrf24_report_rfch_reg(__read_reg(nrf24, NRF24REG_RF_CH));
    __nrf24_report_rfsetup_reg(__read_reg(nrf24, NRF24REG_RF_SETUP));
    __nrf24_report_status_reg(__read_reg(nrf24, NRF24REG_STATUS));
    __nrf24_report_observetx_reg(__read_reg(nrf24, NRF24REG_OBSERVE_TX));

    __nrf24_report_fifostatus_reg(__read_reg(nrf24, NRF24REG_FIFO_STATUS));
    __nrf24_report_dynpd_reg(__read_reg(nrf24, NRF24REG_DYNPD));
    __nrf24_report_feature_reg(__read_reg(nrf24, NRF24REG_FEATURE));
    __nrf24_report_addr(nrf24);
}

#endif // NRF24_USING_INFO_REPORT

#ifdef NRF24_USING_SHELL_CMD
#include <stdlib.h>

static void nrf24(int argc, char **argv)
{
    static nrf24_t instance = RT_NULL;

    if (argc < 2)
    {
        rt_kprintf("Usage: nrf24 [OPTION]\n");
        rt_kprintf("Options:\n");
        rt_kprintf("    init <spi_dev_name> <ce_pin>\n");
        rt_kprintf("    probe\n");
        rt_kprintf("    check_halport\n");
        rt_kprintf("    read <reg>\n");
        rt_kprintf("    write <reg> <byte>\n");
#ifdef NRF24_USING_INFO_REPORT
        rt_kprintf("    report\n");
#endif // NRF24_USING_INFO_REPORT

        return;
    }

#ifdef NRF24_USING_INFO_REPORT
    if (!rt_strcmp(argv[1], "report"))
    {
        nrf24_report(instance);
    }
#endif // NRF24_USING_INFO_REPORT

    if (!rt_strcmp(argv[1], "check_halport"))
    {
        if (check_halport(&instance->halport) == RT_EOK)
            rt_kprintf("OK\n");
        else
            rt_kprintf("ERROR\n");
    }
    else if (!rt_strcmp(argv[1], "probe"))
    {
        if (g_debug_nrf24 != RT_NULL)
        {
            instance = g_debug_nrf24;
            rt_kprintf("OK\n");
        }
        else
            rt_kprintf("ERROR\n");
    }

    if (argc < 3)
    {
        return;
    }
    if (!rt_strcmp(argv[1], "read"))
    {
        uint8_t reg = atoi(argv[2]);
        rt_kprintf("reg:0x%x val: 0x%x\n", reg, __read_reg(instance, reg));
    }

    if (argc < 4)
    {
        return;
    }
    if (!rt_strcmp(argv[1], "write"))
    {
        uint8_t reg = atoi(argv[2]);
        uint8_t data = atoi(argv[3]);
        __write_reg(instance, reg, data);
    }
    else if (!rt_strcmp(argv[1], "init"))
    {
        char *name = argv[2];
        int pin = atoi(argv[3]);
        struct nrf24_callback cb = {0};

        if (instance != RT_NULL)
            return;

        instance = nrf24_default_create(name, pin, NRF24_PIN_NONE, &cb, ROLE_PTX);

        if (instance)
            rt_kprintf("OK\n");
        else
            rt_kprintf("\nFAILED!\n");
    }
}
MSH_CMD_EXPORT(nrf24, nrf24l01);

#endif // NRF24_USING_SHELL_CMD

/** E DEBUG */
